app/views/items/index.html.erb

SELECT `items`.* FROM `items`
---
 <p> <%= f.label "Call Number" %>
  <%= f.select :call_number_eq, Item. get_item_call_number, :size => 20 %></p>