app/controllers/items_controller.rb

  def index
      require 'csv'
      @q = Item.includes(:checkouts).search(params[:q])
---
SELECT `items`.* FROM `items`